src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/НастройкиПользователей/ManagerModule.bsl
#Область Интерфейс

Функция ПринтерЭтикеток() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.ПринтерЭтикеток);	
КонецФункции

Функция ПринтерЧеков() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.ПринтерЧеков);	
КонецФункции

Функция РедактироватьДокументыВЗакрытомПериоде() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.РедактироватьДокументыВЗакрытомПериоде);	
КонецФункции

Функция СкладПользователя() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.Magasin);	
КонецФункции

Функция КассаПользователя() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.Касса);	
КонецФункции

Функция ЗаверениеЦен() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.ЗаверениеЦен);	
КонецФункции

Функция РедактироватьЗавершенныеДокументы() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.РедактироватьЗавершенныеДокументы);	
КонецФункции

Функция ЭтоКассир() Экспорт
	Возврат ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.ВидыНастроекПользователей.Кассир);	
КонецФункции

#КонецОбласти

#Область Дополнительно

Функция ПолучитьЗначениеНастройки(Настройка)
	УстановитьПривилегированныйРежим(Истина);
	Результат = РегистрыСведений.НастройкиПользователей.Получить(Новый Структура("Пользователь, Настройка", ПараметрыСеанса.Пользователь, Настройка));		
	Возврат ?(Результат.Значение = Неопределено, Настройка.ТипЗначения.ПривестиЗначение(), Результат.Значение);	
КонецФункции	

#КонецОбласти
